{
    "Prevention": [
        "Install smoke detectors in every room.",
        "Regularly test smoke detectors and replace batteries.",
        "Keep flammable items away from heat sources.",
        "Create a fire escape plan and practice it with your family.",
        "Store matches and lighters out of reach of children.",
        "Properly store flammable chemicals in well-ventilated areas.",
        "Keep stovetops and ovens clean to prevent grease fires.",
        "Avoid overloading electrical outlets and circuits.",
        "Use flameless LED candles instead of real candles.",
        "Never leave cooking or heating equipment unattended.",
        "Install a fire sprinkler system in your home.",
        "Keep a fire extinguisher in the kitchen and other key areas.",
        "Regularly clean chimneys and flues.",
        "Use spark arresters on chimneys.",
        "Keep barbecue grills away from structures.",
        "Store firewood away from your home.",
        "Prohibit smoking indoors and create designated outdoor smoking areas.",
        "Educate family members about fire safety.",
        "Install fire-resistant roofing materials.",
        "Install spark-resistant mesh under decks.",
        "Trim branches near the roof and chimney.",
        "Use fire-resistant curtains and window treatments.",
        "Install fire-resistant insulation.",
        "Install and maintain lightning protection systems.",
        "Secure gas lines and check for leaks regularly.",
        "Use fire-resistant building materials.",
        "Install fire-resistant doors.",
        "Create defensible space around your property.",
        "Regularly clear dry leaves and debris from gutters and roofs.",
        "Use fire-resistant paint for the exterior of your home.",
        "Install fire-resistant window glass.",
        "Avoid burning leaves or other debris in windy conditions.",
        "Keep a safe distance from fireworks displays.",
        "Properly dispose of ashes from fireplaces and grills.",
        "Store propane tanks upright and outdoors.",
        "Regularly inspect and clean dryer vents.",
        "Use metal screens in windows and doors.",
        "Install fire-resistant siding materials.",
        "Teach children about the dangers of fire and matches.",
        "Install fire-resistant garage doors.",
        "Prohibit open burning during dry or windy conditions.",
        "Keep space heaters away from flammable materials.",
        "Install fire-resistant flooring materials.",
        "Regularly inspect and maintain electrical wiring.",
        "Use fire-resistant furniture and furnishings.",
        "Avoid using damaged electrical cords or plugs.",
        "Properly store and handle flammable liquids.",
        "Install fire-resistant landscaping features.",
        "Avoid using unapproved electrical appliances.",
        "Prohibit smoking in bed.",
        "Install fire-resistant air vents.",
        "Regularly inspect and maintain HVAC systems.",
        "Use metal containers for ash disposal.",
        "Properly store and handle gas cylinders.",
        "Secure outdoor trash cans to prevent them from tipping over.",
        "Use flame-retardant sprays on curtains and fabrics.",
        "Install fire-resistant patio furniture.",
        "Prohibit the use of candles in bedrooms.",
        "Install fire-resistant pet doors.",
        "Use fire-resistant decorative materials.",
        "Regularly clean and maintain gas grills.",
        "Install fire-resistant playground equipment.",
        "Keep fire lanes clear of obstructions.",
        "Use fire-resistant deck materials.",
        "Regularly inspect and maintain fire alarms.",
        "Install fire-resistant holiday decorations.",
        "Prohibit the use of fireworks in residential areas.",
        "Use fire-resistant pool chemicals.",
        "Secure outdoor electrical outlets with weatherproof covers.",
        "Install fire-resistant garden hoses.",
        "Regularly inspect and maintain fire hydrants.",
        "Use fire-resistant mailbox materials.",
        "Prohibit the use of lanterns with open flames indoors.",
        "Install fire-resistant outdoor lighting fixtures.",
        "Secure propane gas lines with proper fittings.",
        "Regularly inspect and maintain fire escape ladders.",
        "Use fire-resistant outdoor cushions.",
        "Install fire-resistant birdhouses and feeders.",
        "Prohibit the use of space heaters in bedrooms.",
        "Secure outdoor play equipment to prevent tipping.",
        "Use fire-resistant outdoor rugs.",
        "Regularly inspect and maintain fire pit areas.",
        "Install fire-resistant fence materials.",
        "Prohibit the use of portable generators indoors.",
        "Secure outdoor umbrellas to prevent them from falling.",
        "Use fire-resistant garden mulch.",
        "Regularly inspect and maintain fire-safe document storage.",
        "Install fire-resistant bird repellent devices.",
        "Prohibit the use of outdoor torches near structures.",
        "Secure outdoor grilling tools and utensils.",
        "Use fire-resistant plant containers.",
        "Regularly inspect and maintain fire-resistant safes.",
        "Install fire-resistant wind chimes.",
        "Prohibit the use of outdoor fire lanterns near flammable materials.",
        "Secure outdoor furniture covers to prevent them from blowing away.",
        "Use fire-resistant curtain rods.",
        "Regularly inspect and maintain fire-resistant storage boxes.",
        "Install fire-resistant windsocks."    
    ],
    "Cause": [
        "Electrical malfunction",
        "Smoking in prohibited areas",
        "Gas leaks",
        "Kitchen accidents",
        "Arson",
        "Candles left unattended",
        "Overloaded electrical circuits",
        "Appliance malfunctions",
        "Children playing with fire",
        "Improper use of heating devices",
        "Careless disposal of cigarettes",
        "Flammable liquids",
        "Lightning strikes",
        "BBQ grills left unattended",
        "Sparks from welding or cutting",
        "Faulty wiring",
        "Combustible dust",
        "Chemical reactions",
        "Spontaneous ignition",
        "Faulty batteries",
        "Christmas tree lights",
        "Lack of proper maintenance",
        "Unattended stoves",
        "Hazardous waste",
        "Flammable fabrics",
        "Fireworks",
        "Hot work activities",
        "Ashes not properly disposed of",
        "Blocked chimneys",
        "Ignition sources near flammable materials",
        "Static electricity",
        "Lack of fire safety education",
        "Wildfires",
        "Illegal burning",
        "Careless use of matches",
        "Distracted cooking",
        "Unattended open flames",
        "Combustible packaging materials",
        "Lack of fire-resistant materials",
        "Unsafe storage of flammable materials",
        "Faulty gas appliances",
        "Inadequate fire suppression systems",
        "Lack of firebreaks in forests",
        "Damaged power lines",
        "Lack of fire-resistant landscaping",
        "Unsafe handling of fireworks",
        "Unsafe disposal of firecrackers",
        "Ignoring smoking bans",
        "Illegal campfires",
        "Uncontrolled bonfires",
        "Improper use of fire extinguishers",
        "Ignition near dry vegetation",
        "Inadequate fire alarm systems",
        "Poorly maintained fire alarms",
        "Lack of fire safety regulations",
        "Faulty fire sprinkler systems",
        "Open burning of debris",
        "Unsafe storage of matches",
        "Unsafe storage of lighters",
        "Inadequate fire safety signage",
        "Overheated equipment",
        "Malfunctioning HVAC systems",
        "Broken gas lines",
        "Improperly discarded cigarettes",
        "Lack of lightning protection systems",
        "Unattended incense sticks",
        "Damaged electrical cords",
        "Lack of smoke detectors",
        "Ignoring fire bans during droughts",
        "Lack of fire safety drills",
        "Unsafe handling of flammable liquids",
        "Improperly maintained gas grills",
        "Unsafe storage of propane tanks",
        "Lack of fire-resistant roofing materials",
        "Faulty electrical outlets",
        "Ignoring safety instructions on appliances",
        "Unauthorized use of fireworks",
        "Lack of fire-resistant building materials",
        "Negligent behavior near open flames",
        "Ignoring safety guidelines for fireplaces",
        "Unsafe disposal of oil-soaked rags",
        "Inadequate fire safety inspections",
        "Faulty heating equipment",
        "Poorly maintained chimneys",
        "Ignoring fire safety warnings",
        "Improperly stored chemicals",
        "Lack of fire-resistant curtains",
        "Unattended burning candles",
        "Negligent use of lighters",
        "Faulty circuit breakers",
        "Ignoring fire safety in industrial settings",
        "Unsafe storage of paint thinners",
        "Lack of fire-resistant furniture",
        "Unsupervised use of matches by children",
        "Unsafe storage of gasoline",
        "Negligent use of space heaters",
        "Ignoring safety guidelines for electrical appliances",
        "Faulty power strips",
        "Lack of fire-resistant insulation",
        "Unsafe disposal of fireworks debris",
        "Negligent use of soldering equipment",
        "Ignoring safety instructions for gas appliances",
        "Faulty extension cords",
        "Lack of fire-resistant flooring materials",
        "Unsafe storage of firewood",
        "Negligent use of welding equipment"
        ],
    "Effect": [
        "Fire can spread quickly, doubling in size every 30 seconds.",
        "Smoke inhalation is a leading cause of fire-related deaths.",
        "Candles are responsible for thousands of fires each year.",
        "Electrical malfunctions can lead to fires, so check wiring regularly.",
        "Smoking is a leading cause of fire-related fatalities.",
        "Flammable liquids should be stored in cool, well-ventilated areas.",
        "Never leave a stove or oven unattended while cooking.",
        "Keep flammable materials away from heat sources.",
        "Smoke alarms can save lives by detecting fires early.",
        "Fire extinguishers should be accessible and in working condition.",
        "Plan and practice fire escape routes with your family.",
        "Stop, drop, and roll is the recommended response if you catch fire.",
        "Different fire extinguishers are designed for various types of fires.",
        "Class A fires involve ordinary combustibles like wood and paper.",
        "Class B fires involve flammable liquids like gasoline or oil.",
        "Class C fires involve electrical equipment.",
        "Class D fires involve combustible metals like magnesium.",
        "Class K fires involve cooking oils and fats.",
        "Carbon monoxide (CO) is a colorless, odorless gas produced by fires.",
        "Carbon monoxide detectors are essential for homes with fuel-burning appliances.",
        "Wildfires can spread rapidly in dry, windy conditions.",
        "Arson is the intentional act of setting fires maliciously.",
        "Fireworks should be handled with care to prevent accidents.",
        "Children should be educated about fire safety from an early age.",
        "Fire drills in schools and workplaces prepare people for emergencies.",
        "Never overload electrical outlets or power strips.",
        "Keep flammable materials at least three feet away from heaters.",
        "Fire-resistant building materials can slow the spread of fire.",
        "Firefighters use water, foam, or other agents to extinguish fires.",
        "Fire hoses can deliver hundreds of gallons of water per minute.",
        "Firefighters wear protective gear, including helmets and oxygen tanks.",
        "High-rise buildings have fire safety features like sprinkler systems.",
        "Fire blankets can smother small fires safely.",
        "A fire can produce temperatures of over 1,000 degrees Fahrenheit.",
        "Smoke can make it difficult to see and breathe in a fire.",
        "Heat rises, so stay low in a smoke-filled room.",
        "Closing doors can slow the spread of smoke and fire.",
        "Fire can damage the structural integrity of buildings.",
        "Fire-safe storage boxes can protect important documents.",
        "Chimney fires can occur if chimneys aren't cleaned regularly.",
        "Flammable gas leaks can lead to explosions and fires.",
        "Fire-resistant clothing is used in industries like firefighting and welding.",
        "Fireworks displays are carefully controlled to prevent accidents.",
        "Fire ants can deliver painful stings.",
        "Fire whirls are tornado-like phenomena created by fires.",
        "Firefighters use thermal imaging cameras to locate people in smoke-filled buildings.",
        "Wildland firefighters battle wildfires in remote areas.",
        "Prescribed burns are used to prevent larger, uncontrolled wildfires.",
        "Fires can produce toxic gases like hydrogen cyanide.",
        "Water can be used to cool surfaces and extinguish flames.",
        "Dry chemical extinguishers are effective for Class A, B, and C fires.",
        "Fire-resistant paint can protect surfaces from flames.",
        "Fire hydrants provide a ready source of water for firefighters.",
        "Sprinkler systems can activate automatically to control fires.",
        "Firebreaks are cleared areas used to stop the spread of wildfires.",
        "Spontaneous combustion can occur in certain materials.",
        "Fire tornadoes can be extremely dangerous.",
        "The Great Fire of London in 1666 destroyed much of the city.",
        "Firewalking is a practice of walking barefoot on hot coals.",
        "Fire dancers use flames in their performances.",
        "Molotov cocktails are improvised incendiary devices.",
        "Fireflies produce light through a chemical reaction.",
        "Dragons are mythical creatures often associated with fire.",
        "Phoenixes are legendary birds that are reborn in fire.",
        "Fire-breathing is a circus act where performers exhale flames.",
        "The International Fire Code sets safety standards for buildings.",
        "Fire safety is a critical concern in the aviation industry.",
        "Spacecraft use fire-resistant materials to minimize fire risk.",
        "Fire can alter ecosystems by promoting new growth.",
        "Sparks from metal grinding can start fires.",
        "Fires can create their weather systems.",
        "Fire is a key element in many religious rituals.",
        "Fireworks were invented in ancient China.",
        "The Chicago Fire of 1871 caused widespread destruction.",
        "Firefighting foam can smother liquid fires.",
        "Fire alarms can be connected to central monitoring stations.",
        "Certain chemicals can ignite spontaneously when exposed to air.",
        "Fire hoses are made of synthetic materials to resist deterioration.",
        "Fire-resistant safes are used to protect valuables.",
        "Electricity can start fires if wiring is faulty or overloaded.",
        "Cigarettes can smolder and start fires if not properly extinguished.",
        "Cooking sprays can be flammable if exposed to high heat.",
        "Flammable gases are used as fuel in many industries.",
        "Fires can release greenhouse gases like carbon dioxide.",
        "Fires can create firestorms that are nearly impossible to control.",
        "Some plants rely on fire to germinate their seeds.",
        "Smoke can contain harmful chemicals and particulate matter.",
        "Ash from fires can fertilize soil.",
        "Lava from volcanoes can start fires in its path.",
        "Fire ants build elaborate underground colonies.",
        "Firefighters use hoses to direct water or foam at the base of flames.",
        "Fire trucks carry various tools and equipment for firefighting.",
        "Firefighters undergo extensive training to handle emergencies.",
        "Emergency fire shelters are used by wildland firefighters.",
        "The Great Chicago Fire led to significant changes in fire safety.",
        "Smoke detectors can be powered by batteries or electricity.",
        "Heat detectors are sensitive to rapid temperature increases.",
        "Fire extinguishers have a limited effective range.",
        "Halon gas extinguishers are effective but harmful to the ozone layer.",
        "Fire-resistant glass can prevent flames from spreading.",
        "Burning fossil fuels contributes to air pollution and climate change.",
        "Wildfires can have long-lasting environmental impacts.",
        "Fire can be a natural part of forest ecosystems.",
        "Fires can create unique habitats for certain species.",
        "Fire is used in controlled burns to manage vegetation.",
        "Fire-resistant clothing is essential for firefighters' safety.",
        "Fire twirling is a performance art involving flaming staffs.",
        "Fire poi is a form of juggling with flaming balls.",
        "Fire juggling is a circus act involving tossing flaming objects.",
        "Fire-spitting performers expel flammable liquids to create fireballs.",
        "Fires can generate their wind, known as a firestorm.",
        "The Fire Triangle concept was developed in the early 20th century.",
        "Fire safety codes vary by country and region.",
        "Fire drills are practiced in schools to prepare students for emergencies.",
        "Fire safety education is part of many community outreach programs.",
        "Sparklers are common fireworks used during celebrations.",
        "Molotov cocktails are considered incendiary weapons.",
        "Fire dancing is a traditional art form in many cultures.",
        "Fire manipulation is a skill involving fire handling.",
        "Smokejumpers are specially trained firefighters who parachute into remote areas.",
        "Fire tornadoes are extremely rare and dangerous natural phenomena.",
        "The fire resistance of materials is tested in laboratories.",
        "Fire-resistant clothing is also used by race car drivers.",
        "Wildland firefighters often work in challenging terrain.",
        "Backdraft is a sudden explosion caused by reintroducing oxygen to a smoldering fire.",
        "Pyromania is a psychological disorder characterized by an obsession with fire.",
        "Fires can produce vivid sunsets due to scattered light.",
        "Firewalking ceremonies are practiced in some cultures as a rite of passage.",
        "Fire safety laws require businesses to have fire extinguishers and alarms.",
        "Firefighters are trained to stay calm under extreme pressure.",
        "Fires can be started deliberately as a form of protest.",
        "Firefighters are often depicted as heroes in popular culture.",
        "Wildfires can destroy homes, wildlife habitats, and infrastructure.",
        "Fire tornadoes can reach wind speeds of over 100 mph.",
        "Fire safety drills are conducted in schools to educate students.",
        "Firefighters communicate using specialized radio systems.",
        "Fire departments use sirens and lights to respond quickly to emergencies.",
        "Fire-resistant building materials are used in construction to enhance safety.",
        "Fire blankets can be used to smother small fires safely.",
        "Firefighters can face dangerous situations like collapsing buildings.",
        "Fireproof safes are used to protect important documents from fires.",
        "Flammable gases like propane are used in outdoor grills.",
        "Spacecraft have to consider fire safety in their design.",
        "Fire safety is a key concern in laboratories handling hazardous materials.",
        "The first recorded use of fire dates back over a million years.",
        "Homes in wildfire-prone areas often have defensible space around them.",
        "Wildland firefighters use controlled burns to create firebreaks.",
        "The Great Fire of London led to improvements in urban planning.",
        "Fire alarms can be connected to building sprinkler systems.",
        "Carbon monoxide detectors are essential in homes with gas appliances.",
        "The Hindenburg disaster was caused by a fire involving a hydrogen-filled airship.",
        "Certain metals can ignite spontaneously when exposed to air.",
        "Firefighters use different techniques to extinguish different types of fires.",
        "Fire-resistant paint is used on steel structures to prevent heat transfer.",
        "Fire hydrants are strategically placed throughout cities.",
        "Fire-resistant building materials are used to enhance safety.",
        "Firefighters can face hazardous conditions like collapsing structures.",
        "Fireproof safes protect important documents from fire damage.",
        "Spacecraft must consider fire safety in their design.",
        "Fire safety is a key concern in labs handling hazardous materials.",
        "Smoke inhalation is a leading cause of fire-related fatalities."
    ],
    "Types": [
        "Class A Fire: Involves common combustibles like wood and paper",
        "Class B Fire: Includes flammable liquids such as gasoline and oil",
        "Class C Fire: Involves electrical equipment and appliances",
        "Class D Fire: Involves combustible metals like magnesium and titanium",
        "Class K Fire: Involves cooking oils and fats in commercial kitchens",
        "Wildfire: Is an uncontrolled fire in forests, grasslands, or other natural areas",
        "Arson: Is a deliberately set fire for malicious intent",
        "Bushfire: Is a common term for wildfires in Australia and some other regions",
        "Chemical Fire: Involves hazardous chemicals or substances catching fire",
        "Forest Fire: Is a large outdoor fire that occurs in wooded areas",
        "House Fire: Is a fire occurring within a residential structure",
        "Electrical Fire: Is caused by faulty wiring or overloaded circuits",
        "Gas Fire: Involves natural gas or propane catching fire",
        "Oil Fire: Involves oil-based products like fuel or lubricants catching fire",
        "Car Fire: Involves a vehicle catching fire",
        "Warehouse Fire: Is a fire occurring in storage facilities",
        "Tunnel Fire: Is a fire in an enclosed underground passage",
        "Garage Fire: Is a fire in a building for housing vehicles or equipment",
        "Trash Fire: Involves burning waste materials",
        "Chimney Fire: Is a fire in the chimney of a house or building",
        "Candle Fire: Is caused by burning candles",
        "Grass Fire: Is a fire in grassy areas, often due to dry conditions",
        "Rubbish Fire: Involves small fires with household waste materials",
        "Dumpster Fire: Is a fire occurring in large waste containers",
        "Silo Fire: Is a fire in a storage tower, typically used for grain or coal",
        "Recycling Fire: Is a fire in a recycling facility due to combustible materials",
        "Lawnmower Fire: Involves fire with lawnmower equipment",
        "Boat Fire: Is a fire occurring on a boat or ship",
        "Tire Fire: Involves large fires with rubber tires",
        "Plastic Fire: Involves fire with plastic materials",
        "Warehouse Fire: Is a fire occurring in storage facilities",
        "Attic Fire: Is a fire in the uppermost space of a building",
        "Bedroom Fire: Originates in a bedroom",
        "Living Room Fire: Occurs in the main living area of a house",
        "Apartment Fire: Occurs within an apartment building",
        "Dormitory Fire: Occurs in a college or school dormitory",
        "High-Rise Fire: Occurs in a tall building, often challenging for firefighters",
        "Barn Fire: Occurs in a farm building",
        "Cafeteria Fire: Occurs in a dining establishment",
        "Movie Theater Fire: Occurs in a cinema or theater",
        "Nursing Home Fire: Occurs in a facility caring for the elderly",
        "Hospital Fire: Occurs within a medical facility",
        "Hotel Fire: Occurs within a hotel or lodging establishment",
        "Stadium Fire: Occurs in a sports arena or stadium",
        "Airport Fire: Occurs in an airport terminal or hangar",
        "Mall Fire: Occurs within a shopping mall",
        "Restaurant Fire: Occurs in a dining establishment",
        "School Fire: Occurs within an educational institution",
        "Hospitality Fire: Occurs in establishments like bars and clubs",
        "Museum Fire: Occurs in a museum",
        "Office Fire: Occurs in a workplace or office building",
        "Church Fire: Occurs within a religious institution",
        "Library Fire: Occurs in a library or book repository",
        "Gas Station Fire: Occurs at a fueling station",
        "Railway Fire: Involves trains or railway tracks catching fire",
        "Aircraft Fire: Occurs on an airplane or at an airport runway",
        "Military Fire: Involves fire incidents in military installations",
        "Laboratory Fire: Occurs in a scientific research facility",
        "Construction Fire: Occurs in a building under construction",
        "Tunnel Fire: Occurs in an underground passage",
        "Nightclub Fire: Occurs in an entertainment venue",
        "Basement Fire: Occurs in the lower level of a building",
        "Camping Fire: Occurs in outdoor camping areas",
        "Holiday Decoration Fire: Caused by holiday-related items catching fire",
        "Fireworks Mishap: Involves accidental ignition of fireworks",
        "Concert Fire: Occurs in a concert venue or open-air concert space",
        "Bakery Fire: Occurs in a bakery or baking facility",
        "Oil Rig Fire: Occurs on an offshore drilling platform",
        "Chemical Plant Fire: Occurs in a facility processing chemicals",
        "Welding Fire: Caused during welding operations",
        "Textile Factory Fire: Occurs in a facility manufacturing textiles",
        "Petroleum Refinery Fire: Occurs in a facility processing crude oil",
        "Amusement Park Fire: Occurs in an amusement park",
        "Auto Repair Shop Fire: Occurs in a garage or workshop repairing vehicles",
        "Carpet Factory Fire: Occurs in a facility manufacturing carpets or rugs",
        "Coal Mine Fire: Occurs in underground coal mines",
        "Paper Mill Fire: Occurs in a facility producing paper products",
        "Sugar Refinery Fire: Occurs in a facility processing sugar",
        "Nuclear Power Plant Fire: Involves fire incidents in nuclear power facilities",
        "Fire on Board Ship: Occurs on a seafaring vessel",
        "Haystack Fire: Occurs in a stack of hay or straw",
        "Tanning Factory Fire: Occurs in a facility processing leather",
        "Chemical Storage Fire: Occurs in facilities storing chemicals",
        "Fire in Greenhouse: Occurs in a structure used for cultivating plants",
        "Poultry Farm Fire: Occurs in a facility housing poultry",
        "Dairy Farm Fire: Occurs in a facility housing dairy animals",
        "Lumber Yard Fire: Occurs in a facility storing lumber",
        "Plastics Factory Fire: Occurs in a facility producing plastic products",
        "Petrochemical Plant Fire: Occurs in a facility processing petrochemicals",
        "Cotton Mill Fire: Occurs in a facility manufacturing cotton textiles",
        "Oil Depot Fire: Occurs in a facility storing large quantities of oil",
        "Furniture Factory Fire: Occurs in a facility producing furniture",
        "Industrial Oven Fire: Occurs in an industrial baking or drying oven",
        "Laboratory Chemical Fire: Involves chemicals in a scientific laboratory catching fire",
        "Solvent Storage Fire: Occurs in facilities storing volatile solvents",
        "Sawmill Fire: Occurs in a facility processing timber into lumber",
        "Metal Foundry Fire: Occurs in a facility casting metal products",
        "Rice Mill Fire: Occurs in a facility processing rice grains",
        "Grain Elevator Fire: Occurs in a facility storing grain",
        "Waste Treatment Plant Fire: Occurs in a facility treating industrial or municipal waste"
    ]
}
